- Title: SQL basics
- Slug: sql_basics
- Summary: SQL basics
- Date: 2017-04-03 12:00
- Category: misc
- Tags: sql
- Authors: James Loach

### Setup

* Download ipython-sql from [here](https://github.com/catherinedevlin/ipython-sql) 
or use `pip install ipython-sql`
* Download Iris dataset in `csv` format from [here](https://archive.ics.uci.edu/ml/datasets/Iris)
* Install `postgresql` locally

In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
%load_ext sql
%config SqlMagic.feedback = False
%sql postgresql://jloach@/

'Connected: jloach@'

Make a database to play with

In [3]:
%%sql
DROP TABLE parishes; -- Delete existing table under this name
CREATE TABLE parishes(
  id          INT PRIMARY KEY NOT NULL, 
  name        TEXT,
  population  INT,
  loc_n       REAL,
  loc_w       REAL
);
INSERT INTO parishes VALUES (1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284);
INSERT INTO parishes VALUES (2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2);
INSERT INTO parishes VALUES (3, 'Church Eaton', 680, 52.757, 2.222);
INSERT INTO parishes VALUES (4, 'Penkridge', 8526, NULL, NULL);
INSERT INTO parishes VALUES (5, 'Sheriffhales', 722, NULL, NULL);

[]

### SELECT

In [4]:
%sql SELECT * FROM parishes

[(1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284),
 (2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2),
 (3, 'Church Eaton', 680, 52.757, 2.222),
 (4, 'Penkridge', 8526, None, None),
 (5, 'Sheriffhales', 722, None, None)]

In [5]:
%%sql
SELECT name as "Parish",
       population as "Population" 
  FROM parishes

[('Blymhill & Weston-under-Lizard', 823),
 ('Lapley, Stretton and Wheaton Aston', 2548),
 ('Church Eaton', 680),
 ('Penkridge', 8526),
 ('Sheriffhales', 722)]

In [6]:
%%sql
SELECT name as "Parish",
       ROUND(population/10.) as "Population/10" 
  FROM parishes

[('Blymhill & Weston-under-Lizard', Decimal('82')),
 ('Lapley, Stretton and Wheaton Aston', Decimal('255')),
 ('Church Eaton', Decimal('68')),
 ('Penkridge', Decimal('853')),
 ('Sheriffhales', Decimal('72'))]

### LIMIT

In [7]:
%%sql
SELECT *
  FROM parishes 
 LIMIT 2

[(1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284),
 (2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2)]

### WHERE

In [8]:
%%sql
SELECT * 
  FROM parishes
 WHERE population > 1000

[(2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2),
 (4, 'Penkridge', 8526, None, None)]

In [9]:
%%sql
SELECT * 
  FROM parishes 
 WHERE name > 'L'

[(2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2),
 (4, 'Penkridge', 8526, None, None),
 (5, 'Sheriffhales', 722, None, None)]

### `LIKE` / `ILIKE`

In [10]:
%%sql
SELECT * 
  FROM parishes 
 WHERE name 
  LIKE 'B%'

[(1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284)]

In [11]:
%%sql
SELECT * 
  FROM parishes 
 WHERE name 
  LIKE 'P_______e'

[(4, 'Penkridge', 8526, None, None)]

In [12]:
%%sql
SELECT * 
  FROM parishes 
 WHERE name 
 ILIKE 'b%'

[(1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284)]

### IN

In [13]:
%%sql
SELECT * 
  FROM parishes 
 WHERE name IN ('Penkridge', 'Church Eaton')

[(3, 'Church Eaton', 680, 52.757, 2.222), (4, 'Penkridge', 8526, None, None)]

### BETWEEN

In [14]:
%%sql
SELECT * 
  FROM parishes 
 WHERE population BETWEEN 500 AND 2000

[(1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284),
 (3, 'Church Eaton', 680, 52.757, 2.222),
 (5, 'Sheriffhales', 722, None, None)]

### NULL

In [15]:
%%sql
SELECT *
  FROM parishes 
 WHERE loc_n IS NULL

[(4, 'Penkridge', 8526, None, None), (5, 'Sheriffhales', 722, None, None)]

### OR / AND / NOT

In [16]:
%%sql
SELECT * 
  FROM parishes 
 WHERE (name LIKE 'P%' OR population < 800) AND NOT loc_n IS NULL

[(3, 'Church Eaton', 680, 52.757, 2.222)]

### ORDER BY / DESC

In [17]:
%%sql
SELECT *
  FROM parishes
 ORDER BY population DESC

[(4, 'Penkridge', 8526, None, None),
 (2, 'Lapley, Stretton and Wheaton Aston', 2548, 52.71, 2.2),
 (1, 'Blymhill & Weston-under-Lizard', 823, 52.702, 2.284),
 (5, 'Sheriffhales', 722, None, None),
 (3, 'Church Eaton', 680, 52.757, 2.222)]

In [18]:
%%sql
SELECT name, population
  FROM parishes
 ORDER BY 2 -- Doesn't' work in all SQL variants

[('Church Eaton', 680),
 ('Sheriffhales', 722),
 ('Blymhill & Weston-under-Lizard', 823),
 ('Lapley, Stretton and Wheaton Aston', 2548),
 ('Penkridge', 8526)]

In [19]:
%%sql
SELECT name, population, loc_n
  FROM parishes
 ORDER BY population, loc_n -- Though this isn't meaningful here

[('Church Eaton', 680, 52.757),
 ('Sheriffhales', 722, None),
 ('Blymhill & Weston-under-Lizard', 823, 52.702),
 ('Lapley, Stretton and Wheaton Aston', 2548, 52.71),
 ('Penkridge', 8526, None)]